In [7]:
import pandas as pd

In [8]:
df_notas = pd.DataFrame({
    "Nome": ["Diana", "Clark", "Bruce", "Bruce"],
    "Port":[9, 7, 8, 8],
    "Mat":[7, 7, 9, 9],
    "Bio":[7, 7, 7, 7]
})
df_notas

    Nome  Port  Mat  Bio
0  Diana     9    7    7
1  Clark     7    7    7
2  Bruce     8    9    7
3  Bruce     8    9    7

In [9]:
# Resumo valores únicos
resumo_valores_unicos = df_notas.nunique()
resumo_valores_unicos

Nome    3
Port    3
Mat     2
Bio     1
dtype: int64

In [10]:
# valores duplicados coluna
# first o primeiro que aparece é o único
# last o último é considerado único
confere_duplicados = df_notas.duplicated(subset="Nome", keep="first")
confere_duplicados

0    False
1    False
2    False
3     True
dtype: bool

In [11]:
# valores duplicados coluna
# False para marcar TODOS valores duplicados como True
confere_duplicados2 = df_notas.duplicated(subset="Nome", keep=False)
confere_duplicados2

0    False
1    False
2     True
3     True
dtype: bool

In [12]:
# Cria coluna com valores duplicados coluna
df_notas["Nome Duplicado"] = df_notas.duplicated(subset="Nome", keep="first")
df_notas

    Nome  Port  Mat  Bio  Nome Duplicado
0  Diana     9    7    7           False
1  Clark     7    7    7           False
2  Bruce     8    9    7           False
3  Bruce     8    9    7            True

In [13]:
# Remover duplicados

remove_duplicados = df_notas.drop_duplicates(subset="Nome", keep="first")
remove_duplicados

    Nome  Port  Mat  Bio  Nome Duplicado
0  Diana     9    7    7           False
1  Clark     7    7    7           False
2  Bruce     8    9    7           False